DonKracho/ESP8266-EspSetup/src/EspSetup.cpp
//=======================================================================
// EspSetup.cpp Arduino EspSetup library ESP8266 / ESP32
// Credits: ESP8266WebServer FSBrowser example from ESp8266 core 
// Author:  Wolfgang Kracht
// Date:    7/19/2020
// Licence: https://www.gnu.org/licenses/gpl-3.0
//=======================================================================

#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include "EspSetup.h"

//#define DEBUG_VERBOSE
#define FileSystemName "LittleFS"

FS* EspFileSytem = &LittleFS;
LittleFSConfig EspFileSytemConfig = LittleFSConfig();

NullSerial NoDebug;
WiFiClient Telnet;
NTPClient  ntp;

//== used for statics and global functions ===

EspSetup *pEspSetup;
Stream   *pEspConsole;

//=== Telnet Server ===

void OnTcpReceive(char* txt) {
  pEspConsole->println(txt);
}

//=== Web Socket Server ===

WebSocketsServer EspWebSocket = WebSocketsServer(81);

int webSocketsConnected = 0;

void EspWebSocketCallback(uint8_t num, WStype_t type, uint8_t *payload, size_t len)
{
  for (WebSocketServerEvent WsCbFn : pEspSetup->GetWebSocketCallbackList()) {
    WsCbFn(num, type, payload, len);
  }
}

void EspWebSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t len)
{
  switch(type) {
    case WStype_DISCONNECTED:
      pEspConsole->printf("[%u] Disconnected!\n", num);
      webSocketsConnected -= 1;
      break;
    case WStype_CONNECTED: {
      IPAddress ip = EspWebSocket.remoteIP(num);
      pEspConsole->printf("[%u] Connected from %d.%d.%d.%d url: %s\n", num, ip[0], ip[1], ip[2], ip[3], payload);
      webSocketsConnected += 1;
      break;
    }
    case WStype_TEXT:
      if (len > 12) {
        if (!strncmp((const char*) payload, "EspSetupPage", 12)) { EspWebSocket.sendTXT(num, pEspSetup->DumpNetworkConfiguration().c_str()); }
        else if (!strncmp((const char*) payload, "EspSetupSave", 12)) { pEspSetup->SaveNetworkConfiguration((char*)&payload[12]); }
        else if (!strncmp((const char*) payload, "EspSetupReset", 13)) { ESP.reset(); }
      }
      break;
    default:
      break;
  }
}

//=== static Web Server callbacks ===

static bool fsOK;
String unsupportedFiles = String();

static const char TEXT_PLAIN[] PROGMEM = "text/plain";
static const char FS_INIT_ERROR[] PROGMEM = "FS INIT ERROR";
static const char FILE_NOT_FOUND[] PROGMEM = "FileNotFound";

////////////////////////////////
// Utils to return HTTP codes, and determine content-type

void replyOK() {
  pEspSetup->send(200, FPSTR(TEXT_PLAIN), "");
}

void replyOKWithMsg(String msg) {
  pEspSetup->send(200, FPSTR(TEXT_PLAIN), msg);
}

void replyNotFound(String msg) {
  pEspSetup->send(404, FPSTR(TEXT_PLAIN), msg);
}

void replyBadRequest(String msg) {
  pEspConsole->println(msg);
  pEspSetup->send(400, FPSTR(TEXT_PLAIN), msg + "\r\n");
}

void replyServerError(String msg) {
  pEspConsole->println(msg);
  pEspSetup->send(500, FPSTR(TEXT_PLAIN), msg + "\r\n");
}

/*
   Return the FS type, status and size info
*/
void EspSetup::handleStatus() {
  pEspConsole->println("handleStatus");
  FSInfo fs_info;
  String json;
  json.reserve(128);

  json = "{\"type\":\"";
  json += FileSystemName;
  json += "\", \"isOk\":";
  if (fsOK) {
    EspFileSytem->info(fs_info);
    json += F("\"true\", \"totalBytes\":\"");
    json += fs_info.totalBytes;
    json += F("\", \"usedBytes\":\"");
    json += fs_info.usedBytes;
    json += "\"";
  } else {
    json += "\"false\"";
  }
  json += F(",\"unsupportedFiles\":\"");
  json += unsupportedFiles;
  json += "\"}";

  pEspSetup->send(200, "application/json", json);
}

/*
   Read the given file from the filesystem and stream it back to the client
*/
bool EspSetup::handleFileRead(String path) {
  pEspConsole->println(String("handleFileRead: ") + path);
  if (!fsOK) {
    replyServerError(FPSTR(FS_INIT_ERROR));
    return true;
  }

  if (path.endsWith("/")) {
    path += "index.htm";
  }

  String contentType;
  if (pEspSetup->hasArg("download")) {
    contentType = F("application/octet-stream");
  } else {
    contentType = mime::getContentType(path);
  }

  if (!EspFileSytem->exists(path)) {
    // File not found, try gzip version
    path = path + ".gz";
  }
  if (EspFileSytem->exists(path)) {
    File file = EspFileSytem->open(path, "r");
    if (pEspSetup->streamFile(file, contentType) != file.size()) {
      pEspConsole->println("Sent less data than expected!");
    }
    file.close();
    return true;
  }

  return false;
}

/*
   As some FS (e.g. LittleFS) delete the parent folder when the last child has been removed,
   return the path of the closest parent still existing
*/
String lastExistingParent(String path) {
  while (!path.isEmpty() && !EspFileSytem->exists(path)) {
    if (path.lastIndexOf('/') > 0) {
      path = path.substring(0, path.lastIndexOf('/'));
    } else {
      path = String();  // No slash => the top folder does not exist
    }
  }
  pEspConsole->println(String("Last existing parent: ") + path);
  return path;
}

/*
   Handle the creation/rename of a new file
   Operation      | req.responseText
   ---------------+--------------------------------------------------------------
   Create file    | parent of created file
   Create folder  | parent of created folder
   Rename file    | parent of source file
   Move file      | parent of source file, or remaining ancestor
   Rename folder  | parent of source folder
   Move folder    | parent of source folder, or remaining ancestor
*/
void EspSetup::handleFileCreate() {
  if (!fsOK) {
    return replyServerError(FPSTR(FS_INIT_ERROR));
  }

  String path = pEspSetup->arg("path");
  if (path.isEmpty()) {
    return replyBadRequest(F("PATH ARG MISSING"));
  }

  if (path == "/") {
    return replyBadRequest("BAD PATH");
  }
  if (EspFileSytem->exists(path)) {
    return replyBadRequest(F("PATH FILE EXISTS"));
  }

  String src = pEspSetup->arg("src");
  if (src.isEmpty()) {
    // No source specified: creation
    pEspConsole->println(String("handleFileCreate: ") + path);
    if (path.endsWith("/")) {
      // Create a folder
      path.remove(path.length() - 1);
      if (!EspFileSytem->mkdir(path)) {
        return replyServerError(F("MKDIR FAILED"));
      }
    } else {
      // Create a file
      File file = EspFileSytem->open(path, "w");
      if (file) {
        file.write((const char *)0);
        file.close();
      } else {
        return replyServerError(F("CREATE FAILED"));
      }
    }
    if (path.lastIndexOf('/') > -1) {
      path = path.substring(0, path.lastIndexOf('/'));
    }
    replyOKWithMsg(path);
  } else {
    // Source specified: rename
    if (src == "/") {
      return replyBadRequest("BAD SRC");
    }
    if (!EspFileSytem->exists(src)) {
      return replyBadRequest(F("SRC FILE NOT FOUND"));
    }

