DonKracho/ESP8266-EspSetup/src/EspSetup.cpp
    pEspConsole->println(String("handleFileCreate: ") + path + " from " + src);

    if (path.endsWith("/")) {
      path.remove(path.length() - 1);
    }
    if (src.endsWith("/")) {
      src.remove(src.length() - 1);
    }
    if (!EspFileSytem->rename(src, path)) {
      return replyServerError(F("RENAME FAILED"));
    }
    replyOKWithMsg(lastExistingParent(src));
  }
}

/*
   Delete the file or folder designed by the given path.
   If it's a file, delete it.
   If it's a folder, delete all nested contents first then the folder itself

   IMPORTANT NOTE: using recursion is generally not recommended on embedded devices and can lead to crashes (stack overflow errors).
   This use is just for demonstration purpose, and FSBrowser might crash in case of deeply nested filesystems.
   Please don't do this on a production system.
*/
void EspSetup::deleteRecursive(String path) {
  File file = EspFileSytem->open(path, "r");
  bool isDir = file.isDirectory();
  file.close();

  // If it's a plain file, delete it
  if (!isDir) {
    EspFileSytem->remove(path);
    return;
  }

  // Otherwise delete its contents first
  Dir dir = EspFileSytem->openDir(path);

  while (dir.next()) {
    deleteRecursive(path + '/' + dir.fileName());
  }

  // Then delete the folder itself
  EspFileSytem->rmdir(path);
}

/*
   Handle a file deletion request
   Operation      | req.responseText
   ---------------+--------------------------------------------------------------
   Delete file    | parent of deleted file, or remaining ancestor
   Delete folder  | parent of deleted folder, or remaining ancestor
*/
void EspSetup::handleFileDelete() {
  if (!fsOK) {
    return replyServerError(FPSTR(FS_INIT_ERROR));
  }

  String path = pEspSetup->arg(0);
  if (path.isEmpty() || path == "/") {
    return replyBadRequest("BAD PATH");
  }

  pEspConsole->println(String("handleFileDelete: ") + path);
  if (!EspFileSytem->exists(path)) {
    return replyNotFound(FPSTR(FILE_NOT_FOUND));
  }
  deleteRecursive(path);

  replyOKWithMsg(lastExistingParent(path));
}

/*
   Handle a file upload request
*/
// holds the currently running upload
File fsUploadFile;
bool uploadActive = false;

void EspSetup::handleFileUpload() {
  if (!fsOK) {
    return replyServerError(FPSTR(FS_INIT_ERROR));
  }
  if (pEspSetup->uri() != "/edit") {
    return;
  }
  uploadActive = true;
  HTTPUpload& upload = pEspSetup->upload();
  if (upload.status == UPLOAD_FILE_START) {
    String filename = upload.filename;
    // Make sure paths always start with "/"
    if (!filename.startsWith("/")) {
      filename = "/" + filename;
    }
    pEspConsole->println(String("handleFileUpload Name: ") + filename);
    fsUploadFile = EspFileSytem->open(filename, "w");
    if (!fsUploadFile) {
      return replyServerError(F("CREATE FAILED"));
    }
    pEspConsole->println(String("Upload: START, filename: ") + filename);
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (fsUploadFile) {
      size_t bytesWritten = fsUploadFile.write(upload.buf, upload.currentSize);
      if (bytesWritten != upload.currentSize) {
        return replyServerError(F("WRITE FAILED"));
      }
    }
    pEspConsole->println(String("Upload: WRITE, Bytes: ") + upload.currentSize);
  } else if (upload.status == UPLOAD_FILE_END) {
    if (fsUploadFile) {
      fsUploadFile.close();
      uploadActive = false;
    }
    pEspConsole->println(String("Upload: END, Size: ") + upload.totalSize);
  }
}


/*
   Return the list of files in the directory specified by the "dir" query string parameter.
   Also demonstrates the use of chuncked responses.
*/
void EspSetup::handleFileList() {
  if (!fsOK) {
    return replyServerError(FPSTR(FS_INIT_ERROR));
  }

  if (!pEspSetup->hasArg("dir")) {
    return replyBadRequest(F("DIR ARG MISSING"));
  }

  String path = pEspSetup->arg("dir");
  if (path != "/" && !EspFileSytem->exists(path)) {
    return replyBadRequest("BAD PATH");
  }

  pEspConsole->println(String("handleFileList: ") + path);
  Dir dir = EspFileSytem->openDir(path);
  path.clear();

  // use HTTP/1.1 Chunked response to avoid building a huge temporary string
  if (!pEspSetup->chunkedResponseModeStart(200, "text/json")) {
    pEspSetup->send(505, F("text/html"), F("HTTP1.1 required"));
    return;
  }

  // use the same string for every line
  String output;
  output.reserve(64);
  while (dir.next()) {
    if (output.length()) {
      // send string from previous iteration
      // as an HTTP chunk
      pEspSetup->sendContent(output);
      output = ',';
    } else {
      output = '[';
    }

    output += "{\"type\":\"";
    if (dir.isDirectory()) {
      output += "dir";
    } else {
      output += F("file\",\"size\":\"");
      output += dir.fileSize();
    }

    output += F("\",\"name\":\"");
    // Always return names without leading "/"
    if (dir.fileName()[0] == '/') {
      output += &(dir.fileName()[1]);
    } else {
      output += dir.fileName();
    }

    output += "\"}";
  }

  // send last string
  output += "]";
  pEspSetup->sendContent(output);
  pEspSetup->chunkedResponseFinalize();
}

// === class EspSetup ===

// Ctor without initialization
EspSetup::EspSetup(Stream& s, int port) : ESP8266WebServer(port), console(s)
{
  pEspSetup = this;
  pEspConsole = &console;
}

// Dtor delete UDP/TCP sockets
EspSetup::~EspSetup()
{
  if (pUdp) delete pUdp;
  if (pTcp) delete pTcp;
}

FS* EspSetup::GetFS()
{
  return EspFileSytem;
}

bool EspSetup::CheckWebServerCredentials() {
  if (webUser != "" && webPass != "") {
    if (!authenticate(webUser.c_str(), webPass.c_str())) {
      requestAuthentication();
      return false;
    }
  }
  return true;
}

void EspSetup::Setup(void){
  console.println("\nbooting...\n");

  EspFileSytemConfig.setAutoFormat(true);
  EspFileSytem->setConfig(EspFileSytemConfig);
  fsOK = EspFileSytem->begin();
  console.println(fsOK ? F("Filesystem initialized.") : F("Filesystem init failed!"));

  LoadNetworkConfiguration();
#ifdef DEBUG_VERBOSE
  console.println(DumpNetworkConfiguration());
#endif
  if (apMode) {
    // settings do not exist, failed or
    // the user configured to run in AP mode anyway.
    // start in AP mode
    StartAPMode();
  } else {
    // settings were loaded successfully,
    // and the user has setup to run as a WLAN client,
    // so try to connect to the given router ssid/password.
    if (!StartClientMode()) {
      // failed to connect to the router,
      // so force AP mode start
      StartAPMode();
    }
  }
  
  if (udpPort != 0) {
    pUdp = new WiFiUDP();
    pUdp->begin(udpPort);
    console.print("UDP server started on port: ");
    console.println(udpPort);
  }

  if (tcpPort != 0) {
    pTcp = new WiFiServer(tcpPort);
    pTcp->begin();
    pTcp->setNoDelay(true);
    console.print("TCP server started on port: ");
    console.println(tcpPort);
  }

  if (IsNTP()) {
    ntp.Setup(ntpHost, gmtOffs);
    console.print("NTP client started on url: ");
    console.println(ntpHost);
  }

  // Multicast Domain Name System
  if (hstName.length() > 0) {
    MDNS.begin(hstName);
    console.printf("mDNS started use http:/%s:%d/setup\n", hstName.c_str(), webPort);
  }

  // SERVER INIT
  // filesystem status
  on("/status", HTTP_GET, handleStatus);
  // list directory
  on("/list", HTTP_GET, handleFileList);
  // load editor
  on("/edit", HTTP_GET, [this]() {
    if (CheckWebServerCredentials()) {
      if (!handleFileRead(F("/esp/edit.htm"))) {
        replyNotFound(FPSTR(FILE_NOT_FOUND));;
      }
    }
  });
  // create file
  on("/edit", HTTP_PUT, handleFileCreate);
  //delete file
  on("/edit", HTTP_DELETE, handleFileDelete);
  //first callback is called after the request has ended with all parsed arguments
  //second callback handles file uploads at that location
  on("/edit", HTTP_POST, [this]() {
    send(200, "text/plain", "");
  }, handleFileUpload);

