DonKracho/ESP8266-EspSetup/src/EspSetup.cpp
  on("/setup", HTTP_GET, [this]() {
     // return WiFi setup page (setup.htm)
	if (CheckWebServerCredentials()) {
      if (!handleFileRead(F("/esp/setup.htm"))) {
        replyNotFound(FPSTR(FILE_NOT_FOUND));;
      }
    }
  });

  // editor reset
  on("/cmd/ESP-Reboot", HTTP_GET, [this]() {
    replyNotFound(FPSTR(FILE_NOT_FOUND));
    delay(100);
    ESP.reset();
  });

  //get heap status, analog input value and all GPIO statuses in one json call
  on("/all", HTTP_GET, [this]() {
    String json = "{";
    json += "\"heap\":" + String(ESP.getFreeHeap());
    json += ", \"analog\":" + String(analogRead(A0));
    json += ", \"gpio\":" + String((uint32_t)(((GPI | GPO) & 0xFFFF) | ((GP16I & 0x01) << 16)));
    json += "}";
    send(200, "text/json", json);
    json = String();
  });

  //called when the url is not defined here
  //use it to load content from SPIFFS
  onNotFound([this]() {
    if (!handleFileRead(uri())) {
      String message = "File Not Found\n";
      message += "\nuri: ";
      message += uri();
      message += "\nmethod: ";
      message += (method() == HTTP_GET) ? "GET" : "POST";
      message += "\narguments: ";
      message += args();
      message += "\n";
      for (uint8_t i = 0; i < args(); i++) {
	    message += " " + argName(i) + ": " + arg(i) + "\n";
      }
      send(404, "text/plain", message);
    }
  });

  //the web interface is always listening, validate port
  if (webPort <= 0 || webPort > 65535) webPort = 80;

  begin(webPort);
  console.print("HTTP server started on port: ");
  console.println(webPort);

  // start webSocket server
  EspWebSocket.begin();
  EspWebSocket.onEvent(EspWebSocketCallback);
  AddWebSocketCallback(EspWebSocketEvent);
  console.println("WebSocket server started");

  OTASetup();
}

void EspSetup::Loop(void) {
  if (WiFi.status() != WL_CONNECTED ) WiFi.reconnect();
  ArduinoOTA.handle();
  handleClient();
  MDNS.update();
  EspWebSocket.loop();
  TcpLoop();
  NtpLoop();
}

void EspSetup::DeepSleep(uint32_t msDelay)
{
  if (dsEnab) {
    delay(msDelay);
    console.println("\nGoing to deep sleep...");
    ESP.deepSleep(dsLoop * 1000);
    delay(0);
  }
}

void EspSetup::NtpLoop()
{
  if (IsNTP()) {
    ntp.Loop();
  }
}

void EspSetup::TcpLoop()
{
  if (!TCP()) return;

  // Cleanup disconnected session
  for(int i = 0; i < MAX_TELNET_CLIENTS; i++) {
    if (TelnetClient[i] && !TelnetClient[i].connected()) {
      console.print("Client disconnected ... terminate session "); console.println(i+1); 
      TelnetClient[i].stop();
    }
  }

  // Check new client connections
  if (TCP()->hasClient()) {
    bool ConnectionEstablished = false;

    for(int i = 0; i < MAX_TELNET_CLIENTS; i++) {
      // find free socket
      if (!TelnetClient[i]) {
        Telnet = TCP()->available();  // last connected socket is used as console output
        while(Telnet.available()) Telnet.read();
        Telnet.flush();               // clear input buffer, else you get strange characters
        TelnetClient[i] = Telnet;

        console.print("New Telnet client connected to session "); console.println(i+1);

        TelnetClient[i].println("Welcome!");
        TelnetClient[i].print("Millis since start: ");
        TelnetClient[i].println(millis());
        TelnetClient[i].print("Free Heap RAM: ");
        TelnetClient[i].println(ESP.getFreeHeap());
        TelnetClient[i].println("----------------------------------------------------------------");

        ConnectionEstablished = true; 
        break;
      }
    }

    if (ConnectionEstablished == false) {
      console.println("No free sessions ... drop connection");
      TCP()->available().stop();
    }
  }

  for(int i = 0; i < MAX_TELNET_CLIENTS; i++) {
    if (TelnetClient[i] && TelnetClient[i].connected()) {
      if(TelnetClient[i].available()) { 
        //get data from the telnet client
        String input;
        while(TelnetClient[i].available()) {
          char c = TelnetClient[i].read();
          input += c;
        }
        if (pTelnetCallbackFn) {
          pTelnetCallbackFn(input);
        }
      }
    }
  }
}

String EspSetup::formatBytes(size_t bytes) {
  if (bytes < 1024) {
    return String(bytes) + "B";
  } else if (bytes < (1024 * 1024)) {
    return String(bytes / 1024.0) + "KB";
  } else if (bytes < (1024 * 1024 * 1024)) {
    return String(bytes / 1024.0 / 1024.0) + "MB";
  } else {
    return String(bytes / 1024.0 / 1024.0 / 1024.0) + "GB";
  }
}

String EspSetup::GetContentType(String filename) {
  if (pEspSetup->hasArg("download")) {
    return "application/octet-stream";
  } else if (filename.endsWith(".htm")) {
    return "text/html";
  } else if (filename.endsWith(".html")) {
    return "text/html";
  } else if (filename.endsWith(".css")) {
    return "text/css";
  } else if (filename.endsWith(".js")) {
    return "application/javascript";
  } else if (filename.endsWith(".png")) {
    return "image/png";
  } else if (filename.endsWith(".gif")) {
    return "image/gif";
  } else if (filename.endsWith(".jpg")) {
    return "image/jpeg";
  } else if (filename.endsWith(".ico")) {
    return "image/x-icon";
  } else if (filename.endsWith(".xml")) {
    return "text/xml";
  } else if (filename.endsWith(".json")) {
    return "text/json";
  } else if (filename.endsWith(".pdf")) {
    return "application/x-pdf";
  } else if (filename.endsWith(".zip")) {
    return "application/x-zip";
  } else if (filename.endsWith(".gz")) {
    return "application/x-gzip";
  }
  return "text/plain";
}

String EspSetup::GetUniqueDeviceName()
{
  String mac = WiFi.macAddress();
  mac.replace(":", "");
  return ((hstName != "") ? hstName : String("ESP")) + "_" + mac.substring(6);
}

// Start AP Mode
bool EspSetup::StartAPMode()
{
  console.print("MAC: ");
  console.println(WiFi.macAddress());
  console.printf("Staring in AP mode with IP: %s and SSID: %s\n", apSip4.c_str(), apName.c_str());

  WiFi.disconnect();
  WiFi.mode(WIFI_AP);

  IPAddress ip, mask;  

  if (!ip.fromString(apSip4)) ip.fromString(DEFAULT_APIP);
  mask.fromString("255.255.255.0");

