DonKracho/ESP8266-EspSetup/src/EspSetup.cpp
  WiFi.disconnect();
  WiFi.softAPConfig(ip, ip, mask);
  WiFi.softAP(apName.c_str(), apPass.c_str(), apChan);
  isApMode = true;

  return true;
}

// Start STA Mode
bool EspSetup::StartClientMode()
{
  byte retries = 80;
  console.print("MAC: ");
  console.println(WiFi.macAddress());
  console.print(String("Starting in STA mode. Connecting to: ") + wlSsid + " ");
#ifdef WIFI_MULTI
  WiFi.mode(WIFI_STA);
  WiFiMulti.addAP(wlSsid.c_str(), wlPass.c_str());
  while (WiFiMulti.run() != WL_CONNECTED && --retries) {
    console.print(".");
    delay(500);
  }
#else
  IPAddress ip, gw, mask, dns;  
  if (ip.fromString(wlSip4))
  {
    gw.fromString("192.168.0.1");
    mask.fromString("255.255.255.0");
    dns.fromString("192.168.0.1");
    WiFi.config(ip, gw, mask, dns);
  }

  if (String(WiFi.SSID()) != wlSsid) {
    WiFi.disconnect();
    WiFi.mode(WIFI_STA);
    WiFi.begin(wlSsid.c_str(), wlPass.c_str());
    WiFi.persistent(true);
    WiFi.setAutoConnect(true);
    WiFi.setAutoReconnect(true);
  }

  while (WiFi.status() != WL_CONNECTED && --retries) {
    console.print(".");
    delay(100);
  }
#endif
  if (retries > 0) {
    console.print(" success IP: ");
    console.println(WiFi.localIP());
  }
  else {
    console.println(" failed!");
    // retry with disconnect
    if (retryloop) {
      retryloop = false;
      WiFi.disconnect();
      return StartClientMode();
    }
  }
  isApMode = (retries <= 0);

  return !isApMode;
}

void EspSetup::OTASetup()
{
  // OTA

  // Port defaults to 8266
  // ArduinoOTA.setPort(8266);

  // Hostname defaults to esp8266-[ChipID]
  // ArduinoOTA.setHostname("myesp8266");

  // No authentication by default
  // ArduinoOTA.setPassword((const char *)"1234");
  
  ArduinoOTA.onStart([this]() {
    console.println("Start");
  });
  
  ArduinoOTA.onEnd([this]() {
    console.println("\nEnd");
  });
  
  ArduinoOTA.onProgress([this](unsigned int progress, unsigned int total) {
    console.printf("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([this](ota_error_t error) {
    console.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) console.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR) console.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) console.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) console.println("Receive Failed");
    else if (error == OTA_END_ERROR) console.println("End Failed");
  });
  
  ArduinoOTA.begin();
}

bool EspSetup::LoadNetworkConfiguration() {
  String netconf;
  bool ret = ReadFile(NETWORK_CONFIGURATION_PATH, netconf);
  if (ret) {
    ret = UpdateNetworkConfiguration(netconf.c_str());
  }
  if (!ret) {
    console.println("Failed to load network configuration");
    // set reasonable defaults
    apName = GetUniqueDeviceName();
    apMode = true;    
  }
  return ret;
}

bool EspSetup::SaveNetworkConfiguration(char *pJson) {
  WriteFile(NETWORK_CONFIGURATION_PATH, pJson);
  return UpdateNetworkConfiguration(pJson);
}

bool EspSetup::UpdateNetworkConfiguration(const char *pJson) {
  bool ret = false;
  StaticJsonDocument<1024> doc;
  if (!deserializeJson(doc, pJson)) {
    JsonObject obj = doc.as<JsonObject>();
    apMode = obj["apMode"];
    if (obj.containsKey("wlSsid")) wlSsid = obj["wlSsid"].as<String>();
    if (obj.containsKey("wlPass")) wlPass = obj["wlPass"].as<String>();
    if (obj.containsKey("wlSip4")) wlSip4 = obj["wlSip4"].as<String>();
    if (obj.containsKey("apName")) apName = obj["apName"].as<String>();
    if (obj.containsKey("apPass")) apPass = obj["apPass"].as<String>();
    if (obj.containsKey("apSip4")) apSip4 = obj["apSip4"].as<String>();
    apChan = obj["apChan"];
    if (obj.containsKey("hstName")) hstName = obj["hstName"].as<String>();
    webPort = obj["webPort"];
    if (obj.containsKey("webUser")) webUser = obj["webUser"].as<String>();
    if (obj.containsKey("webPass")) webPass = obj["webPass"].as<String>();
    udpPort = obj["udpPort"];
    tcpPort = obj["tcpPort"];
    if (obj.containsKey("ntpEnab")) ntpEnab  = obj["ntpEnab"];
    if (obj.containsKey("ntpHost")) ntpHost  = obj["ntpHost"].as<String>();
    gmtOffs = obj["gmtOffs"];
    if (obj.containsKey("dsEnab")) dsEnab = obj["dsEnab"];
    dsLoop = obj["dsLoop"];

    if (apName == "") apName = GetUniqueDeviceName();
    ret = true;
  }
  return ret;
}

String EspSetup::DumpNetworkConfiguration() {
  StaticJsonDocument<512> doc;
  
  doc["apMode"]  = apMode;
  doc["wlSsid"]  = wlSsid;
  doc["wlPass"]  = wlPass;
  doc["wlSip4"]  = wlSip4;
  doc["apName"]  = apName;
  doc["apPass"]  = apPass;
  doc["apChan"]  = apChan;
  doc["apSip4"]  = apSip4;
  doc["hstName"] = hstName;
  doc["webPort"] = webPort;
  doc["webUser"] = webUser;
  doc["webPass"] = webPass;
  doc["udpPort"] = udpPort;
  doc["tcpPort"] = tcpPort;
  doc["ntpEnab"] = ntpEnab;
  doc["ntpHost"] = ntpHost;
  doc["gmtOffs"] = gmtOffs;
  doc["dsEnab"]  = dsEnab;
  doc["dsLoop"]  = dsLoop;
  doc["mac"] = WiFi.macAddress();

  String conf;
  serializeJson(doc, conf);
  return conf;
}

bool EspSetup::WebSocketConnected() {
  return webSocketsConnected > 0;
}

void EspSetup::WebSocketSend(int num, String text) {
  EspWebSocket.sendTXT(num, text.c_str()); 
}

void EspSetup::WebSocketBroadcast(String text) {
  EspWebSocket.broadcastTXT(text.c_str()); 
}

bool EspSetup::WriteFile(const String &rFilePath, const String &rData) {
  bool ret = false;
  if (EspFileSytem) {
    File file = EspFileSytem->open(rFilePath, "w");
    if(file)
    {
      ret = file.write(rData.c_str()) == rData.length();
      file.close();
    }
  }
  return ret;
}

bool EspSetup::WriteFile(const String &rFilePath, const JsonDocument &rDoc) {
  bool ret = false;
  if (EspFileSytem) {
    File file = EspFileSytem->open(rFilePath, "w");
    if(file)
    {
      ret = serializeJsonPretty(rDoc, file) > 0;
      file.close();
    }
  }
  return ret;
}

bool EspSetup::ReadFile(const String &rFilePath, String &rData) {
  bool ret = false;
  if (EspFileSytem && EspFileSytem->exists(rFilePath)) {
    File file = EspFileSytem->open(rFilePath, "r");
    if(file)
    {
      rData = file.readString();
      file.close();
      ret = true;
    }
  }
  return ret;  
}

