DonKracho/ESP8266-EspSetup/src/EspSetup.cpp
bool EspSetup::ReadFile(const String &rFilePath, JsonDocument &rDoc) {
  bool ret = false;
  if (EspFileSytem && EspFileSytem->exists(rFilePath)) {
    File file = EspFileSytem->open(rFilePath, "r");
    if(file)
    {
      ret = file.size() > 0 && !deserializeJson(rDoc, file);
      file.close();
    }
  }
  return ret;
}

//=== class NTPClient ===

#define NTP_INTERVAL 3600                 // updating intervall: 1 hour shoud be sufficient

#define NTP_DEBUG
//#define NTP_DEBUG_VERBOSE
#define TIMELIB_INIT

#define NTP_PACKET_SIZE 48
#define NTP_PORT 123
#define NTP_LOCAL_PORT 4711

NTPClient::~NTPClient() {
  if (pUdp) delete pUdp;
}

bool NTPClient::Setup(String &rUrl, int gmt) {
  url = rUrl;
  setGmtOffset(gmt);
  if (url.length() > 0) {
    pUdp = new WiFiUDP();
    pUdp->begin(NTP_LOCAL_PORT);
    doSync = true;
  }
  return doSync;
}

bool NTPClient::Loop() {
  if (!isValid()) {                         // not initialized jet or request send
    receiveTime();                          // check for returned ntp packege
  }
  if (adjustSeconds() >= nextRequest  && !(pEspSetup->IsAP())) {
    sendRequest();
  }
  return isValid();
}

time_t NTPClient::adjustSeconds() {
  time_t curr = millis(); 
  if (millis() - lastMillis >= 1000ul) {    // subtraction is overflow save 
    lastMillis = curr;
    seconds++;
    isDaylightSavingTime();
  }
  return UtcTime();
}

void NTPClient::sendRequest() {
  IPAddress timeServerIP;

  if (doSync && WiFi.hostByName(url.c_str(), timeServerIP)) {
#ifdef NTP_DEBUG
    pEspConsole->print("NTPClient::sendRequest");
    pEspConsole->print(" to \"");
    pEspConsole->print(url);
    pEspConsole->print("\" IP:");
    pEspConsole->println(timeServerIP);
#endif
    //pUdp->begin(NTP_LOCAL_PORT);
    // prepare packet and send request 
    byte packet[NTP_PACKET_SIZE];
    memset(packet, 0, NTP_PACKET_SIZE); 
    packet[0]  = 0xE3;  // LI, Version, Mode
    packet[1]  = 0;     // Stratum, or type of clock
    packet[2]  = 6;     // Polling Interval
    packet[3]  = 0xEC;  // Peer Clock Precision
    // 8 bytes of zero for Root Delay & Root Dispersion
    packet[12] = 49;
    packet[13] = 0x4E;
    packet[14] = 49;
    packet[15] = 52;
    while (pUdp->parsePacket() > 0); // discard any previously received packets
    pUdp->beginPacket(timeServerIP, NTP_PORT);
    pUdp->write(packet, NTP_PACKET_SIZE);
    pUdp->endPacket();
    sync = false;
    nextRequest = UtcTime() + 10;    // repeat request if there gets no resonse detected within 10s
  }
}

void NTPClient::receiveTime() {
  if (!isValid() && doSync) {
#ifdef NTP_DEBUG_VERBOSE
    pEspConsole->print("NTPClient::receiveTime ");
    pEspConsole->println(millis(),DEC);
#endif
    if (pUdp->parsePacket()) {
      byte packet[NTP_PACKET_SIZE];
      int len = pUdp->read(packet, NTP_PACKET_SIZE);
      decodePacket(packet, len);
    }
  }
}

void NTPClient::decodePacket(const byte* buf, int len) {
  if (len == NTP_PACKET_SIZE) {
    unsigned long highWord, lowWord, epoch;
    highWord = word(buf[40], buf[41]);
    lowWord  = word(buf[42], buf[43]);  
    epoch = highWord << 16 | lowWord;                             // this is UTC time in seconds since 1900
    seconds = epoch - 2208988800ul;                               // convert to unix base (subtract 70 years)
    isDaylightSavingTime();                                       // check for daylight saving
#ifdef TIMELIB_INIT
    setTime(LocalTime());                                         // required for TimeLib calls to now() or without parameter time_t
#endif
    sync = true;                                                  // time is synced now
    nextRequest = UtcTime() + NTP_INTERVAL;                       // timestanp to send next request
#ifdef NTP_DEBUG
    pEspConsole->print("NTPClient::decodePacket : ");
    pEspConsole->println(getDateTimeString());
#endif
  }
}

bool NTPClient::isDaylightSavingTime(time_t const t)
{
  // In Europe the summer time begins the last week of March and ends last Weekend of Octoberand  switches on sunday 2 AM
  // see this link http://www.webexhibits.org/daylightsaving/i.html
  // European Economic Community:
  // Begin DST: Sunday March (31 - (5*y/4 + 4) mod 7) at 1h U.T.
  // End DST: Sunday October (31 - (5*y/4 + 1) mod 7) at 1h U.T.
  // Since 1996, valid through 2099

  static bool dst = true;

  int beginDSTDate=  (31 - (5* year(t) / 4 + 4) % 7);                         // last sunday of March
  int beginDSTMonth=3;                                                        // March
  int endDSTDate= (31 - (5 * year(t) / 4 + 1) % 7);                           // last sunday of October
  int endDSTMonth=10;                                                         // October
  isDst = (                                                                   // calculate DST state
      (month(t) >  beginDSTMonth && month(t) < endDSTMonth)                   // month is in range for sure
   || (month(t) == beginDSTMonth && day(t) > beginDSTDate)                    // begin day is in range for sure
   || (month(t) == endDSTMonth && day(t) < endDSTDate)                        // end day is in range for sure
   || (month(t) == beginDSTMonth && day(t) == beginDSTDate && hour(t) >= 2)   // it is begin day and clock jumps forward fom 2:00am to 3:00am
   || (month(t) == endDSTMonth && day(t) == endDSTDate && dst && hour(t) < 3) // it is end day and clock jumps back from 3:00am to 2:00am
   );
  dst = isDst;                                                                // do not return to daylight saving if just switched to normal
  dstOffset = isDst ? 3600 : 0;                                               // offset has unit seconds

  return isDst;
}

String NTPClient::getDateTimeString(time_t const t)
{
  // ToDo: adapt the string retured to your needs
  char *date_time = (char*) "   00.00.0000 00:00:00";
#if USE_SPRINTF
  const char * day_names[] = { "So", "Mo", "Di", "Mi", "Do", "Fr", "Sa" };
  sprintf(date_time, "%s %02d.%02d.%04d %02d:%02d:%02d", day_name[weekday(t)],day(t),month(t),year(t),hour(t),minute(t),second(t));
#else
  // does not look nice but it is much faster than using sprintf and saves memory (may be relevant for Arduino Uno)
  switch (weekday(t))
  {
    case 1:
      date_time[0] = 'S';
      date_time[1] = 'o';
      break;
    case 2:
      date_time[0] = 'M';
      date_time[1] = 'o';
      break;
    case 3:
      date_time[0] = 'D';
      date_time[1] = 'i';
      break;
    case 4:
      date_time[0] = 'M';
      date_time[1] = 'i';
      break;
    case 5:
      date_time[0] = 'D';
      date_time[1] = 'o';
      break;
    case 6:
      date_time[0] = 'F';
      date_time[1] = 'r';
      break;
    case 7:
      date_time[0] = 'S';
      date_time[1] = 'a';
      break;
  }

  date_time[3] += day(t) / 10;
  date_time[4] += day(t) % 10;
  date_time[6] += month(t) / 10;
  date_time[7] += month(t) % 10;
  date_time[9] += (year(t) / 1000);
  date_time[10] += (year(t) % 1000) / 100;
  date_time[11] += (year(t) % 100) / 10;
  date_time[12] += year(t) % 10;
  
  date_time[14] += hour(t) / 10;
  date_time[15] += hour(t) % 10;
  date_time[17] += minute(t) / 10;
  date_time[18] += minute(t) % 10;
  date_time[20] += second(t) / 10;
  date_time[21] += second(t) % 10;
#endif
  return String(date_time);
}

time_t NTPClient::fromIsoDateTimeString(const String &isoDateTime) {
  tmElements_t tm;
  tm.Second = atoi(isoDateTime.substring(17,19).c_str());
  tm.Minute = atoi(isoDateTime.substring(14,16).c_str());
  tm.Hour = atoi(isoDateTime.substring(11,13).c_str());
  tm.Day = atoi(isoDateTime.substring(8,10).c_str());
  tm.Month = atoi(isoDateTime.substring(5,7).c_str());
  tm.Year = atoi(isoDateTime.substring(0,4).c_str()) - 1970;
  return makeTime(tm);
}

String NTPClient::getIsoDateTimeString(time_t t, const char *ext) {
  char buf[64];
  sprintf(buf, "%04d-%02d-%02dT%02d:%02d:%02d%s", year(t), month(t), day(t), hour(t), minute(t), second(t), ext);
  return String(buf);
}

String NTPClient::getUtcIsoDateTimeString(bool appendZ) {
  return getIsoDateTimeString(UtcTime(), appendZ ? "Z" : "");
}

String NTPClient::getLocalIsoDateTimeString(bool appendGmtOffset) {
  char gmt[8];
  if (appendGmtOffset)
     sprintf(gmt, "%s%02d", gmtOffset >= 0 ? "+" : "-", abs(gmtOffset/3600));
  else
     gmt[0] = '\0';
  return getIsoDateTimeString(LocalTime(), gmt);
}

int NTPClient::getElapsedSecsToday(time_t secs) {
  return elapsedSecsToday(secs);
}
